tap "felixkratz/formulae"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "xz"
brew "arp-scan"
brew "openssl@3"
brew "bat"
brew "btop"
brew "direnv"
brew "duf"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fontforge"
brew "fzf"
brew "git-delta"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "lua"
brew "luarocks"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "pipx"
brew "poppler"
brew "postgresql@14"
brew "python@3.12"
brew "rbenv"
brew "resvg"
brew "ripgrep"
brew "ruff"
brew "sevenzip"
brew "stow"
brew "tree"
brew "uv"
brew "wget"
brew "zlib"
brew "zoxide"
brew "jesseduffield/lazydocker/lazydocker"
cask "bruno"
cask "devutils"
cask "fastmail"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gimp"
cask "iterm2"
cask "mullvad-vpn"
cask "signal"
cask "sublime-merge"
cask "sublime-text"
cask "tor-browser"
cask "visual-studio-code"
cask "zed"
vscode "4ops.terraform"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "jannisx11.batch-rename-extension"
vscode "mark-tucker.aws-cli-configure"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tonsky.theme-alabaster"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "example/gostuff"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
